---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.#ctor
source: html/9a902183-7949-5ffb-7701-dc1180d39d85.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.#ctor Method

color

## Syntax (C#)
```csharp
public ColorWithTransparency()
```